10/data/attachments/7fc2779c94f90c46.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_6a098ebe-a316-49a3-a6fa-8377ab78b4e0</nif:username>
            <nif:friendToBeAdded>Thomas_each_Friend_22342_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>